# 5장 pandas 시작하기
# 5-2 핵심기능

In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

> #### 1. 재색인

In [2]:
obj = Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [3]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [4]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value = 0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

index는 reindex 함수를 사용해서 업데이트가 가능하며, NA 값은 fill_value 명령어를 통해 대체할 수 있음
___

In [5]:
obj3 = Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [6]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

ffill 또는 bfill 메서드를 사용하여 세련된 방법으로 보간 가능
___

In [7]:
frame = DataFrame(np.arange(9).reshape((3,3)),
                  index = ['a', 'b', 'c'],
                 columns = ['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [8]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [9]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

In [10]:
frame.reindex(index = ['a', 'b', 'c', 'd'],
             method = 'ffill')
             #columns = states)

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8
d     6      7           8

In [11]:
frame.loc[['a','b','c','d'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    4.0   NaN         5.0
c    7.0   NaN         8.0
d    NaN   NaN         NaN

> #### 2. 하나의 로우 또는 칼럼 삭제하기

In [12]:
obj = Series(range(5), index = ['a', 'b', 'c', 'd', 'e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [13]:
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [14]:
obj.drop(['c', 'd'])

a    0
b    1
e    4
dtype: int32

___

In [15]:
data = DataFrame(np.arange(16).reshape(4,4),
                index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                columns = ['One', 'two', 'three', 'four'])
data

          One  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [16]:
data.drop(['Colorado', 'Ohio'])

          One  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [17]:
data.drop('two', axis = 1)

          One  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [18]:
data.drop(['two', 'three'], axis = 1)

          One  four
Ohio        0     3
Colorado    4     7
Utah        8    11
New York   12    15

DataFrame에서는 row와 column 모두 drop 가능
___

> #### 3. 색인하기, 선택하기, 거르기

In [19]:
obj = Series(np.arange(4), index = ['a', 'b', 'c', 'd'])
obj

a    0
b    1
c    2
d    3
dtype: int32

In [20]:
obj['b']

1

In [21]:
obj[1]

1

In [22]:
obj[2:4]

c    2
d    3
dtype: int32

In [23]:
obj[['b','c','a']]

b    1
c    2
a    0
dtype: int32

라벨 이름, 순서로 슬라이싱 가능
___

In [24]:
obj['b':'c'] = 5
obj

a    0
b    5
c    5
d    3
dtype: int32

In [25]:
data = DataFrame(np.arange(16).reshape((4,4)),
                index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [26]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [28]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [30]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [32]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [36]:
data.loc['Utah']

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [37]:
data.loc['Utah',['one']]

one    8
Name: Utah, dtype: int32

- 데이터 프레임을 색인 할 경우 열은 이름으로, 행은 숫자로 색인 가능  
- 단, 데이터프레임.loc['행이름'] 으로 행도 선택 가능
___

In [38]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [39]:
data[data<5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [44]:
data.loc['Colorado', 'two']

5

In [52]:
data.iloc[:2, [3, 1]]

          four  two
Ohio         0    0
Colorado     7    5

라벨 색인 기능은 .ix를 활용하면 가능  
.loc는 라벨명 기반, .iloc는 라벨 순서 기반 작동
___

> #### 4. 산술연산과 데이터 정렬

In [53]:
s1 = Series([7.3,-2.5, 3.4, 1.5], index = ['a', 'b', 'c', 'd'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index = ['a', 'c', 'e', 'f', 'g'])
s1

a    7.3
b   -2.5
c    3.4
d    1.5
dtype: float64

In [54]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [55]:
s1 + s2

a    5.2
b    NaN
c    7.0
d    NaN
e    NaN
f    NaN
g    NaN
dtype: float64

겹치는 색인이 없다면 데이터는 NA값을 반환
___

In [56]:
df1 = DataFrame(np.arange(9).reshape((3,3)),
               columns = list('bcd'),
               index = ['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12).reshape((4,3)),
               columns = list('bde'),
               index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [57]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [58]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [59]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

데이터프레임에서의 산술연산도 마찬가지로 겹치는 index값에 한해 적용
___

In [60]:
df1.add(df2, fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

obj.add(obj2, fill_value = 0) 사용 시 빈칸 값도 채워줌
___

In [61]:
df1.reindex(columns = df2.columns, fill_value = 0)

          b  d  e
Ohio      0  2  0
Texas     3  5  0
Colorado  6  8  0

인덱스 재지정 떄도 사용 가능
___

In [67]:
frame = DataFrame(np.arange(12).reshape((4,3)),
                 columns = list('bde'),
                 index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [68]:
series = frame.iloc[0]
series

b    0
d    1
e    2
Name: Utah, dtype: int32

In [69]:
frame-series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [72]:
series2 = Series(range(3), index = list('bef'))
series2

b    0
e    1
f    2
dtype: int32

In [73]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [74]:
series3 = frame['d']
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int32

In [75]:
frame.sub(series3, axis = 0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

데이터프레임과 array 간의 연산은 연산의 반복으로 이루어짐
___

> #### 5. 함수 적용과 매핑

In [77]:
frame = DataFrame(np.random.randn(4,3),
                 columns = list('bde'),
                 index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.589694  0.458595 -1.108200
Ohio    0.553420 -0.102217  0.658282
Texas  -0.313809 -0.116302  1.201371
Oregon  0.833224 -0.565721  0.248935

In [79]:
np.abs(frame)

               b         d         e
Utah    0.589694  0.458595  1.108200
Ohio    0.553420  0.102217  0.658282
Texas   0.313809  0.116302  1.201371
Oregon  0.833224  0.565721  0.248935

유니버셜 함수 적용 가능
___

In [82]:
f = lambda x : x.max() - x.min()

In [83]:
frame.apply(f)

b    1.422918
d    1.024316
e    2.309571
dtype: float64

In [84]:
frame.apply(f, axis =1)

Utah      1.566795
Ohio      0.760498
Texas     1.515180
Oregon    1.398945
dtype: float64

In [85]:
def f(x):
    return Series([x.min(), x.max()], index = ['min', 'max'])

In [86]:
f(frame)

min    b   -0.589694
d   -0.565721
e   -1.108200
dtyp...
max    b    0.833224
d    0.458595
e    1.201371
dtyp...
dtype: object

In [87]:
frame.apply(f)

            b         d         e
min -0.589694 -0.565721 -1.108200
max  0.833224  0.458595  1.201371

lambda 및 사용자 지정 함수도 사용 가능
___

> #### 6. 정렬과 순위

In [88]:
obj = Series(range(4), index = list('dabc'))
obj

d    0
a    1
b    2
c    3
dtype: int32

In [89]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

obj.sort_index()로 인덱스 정렬 가능
___

In [90]:
frame = DataFrame(np.arange(8).reshape((2,4)),
                 index = ['three', 'one'],
                 columns = list('dabc'))
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [91]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

열 정렬에는 axis=1을 옵션으로 사용
___

In [92]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

ascending = False로 내림차순 정렬 가능
___

In [94]:
obj = Series([4,7,-3,2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [95]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

index 말고 value에 따라 정렬하고 싶다면 sort_values()로 수행
___

In [96]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [98]:
obj.sort_values(ascending=False)

2    7.0
0    4.0
5    2.0
4   -3.0
1    NaN
3    NaN
dtype: float64

NaN 값은 항상 마지막에 위치함
___

In [101]:
frame = DataFrame({'b': [4,7, -3, 2], 'a':[ 0, 1, 0, 1]} )
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [102]:
frame.sort_values(by = ['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

옵션에 by= 를 사용하여 값 정렬 순서를 정함
___

In [103]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [104]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [105]:
obj.rank(ascending=False, method = 'max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

obj.rank()로 값 크기에 따라 순위를 매길 수도 있음
___

> #### 7. 중복 색인

In [106]:
obj = Series(range(5), index = list('aabbc'))
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [108]:
obj.index.is_unique

False

In [109]:
obj['a']

a    0
a    1
dtype: int32

In [110]:
obj['c']

4

index 값이 중복되면 Series 객체를 반환, 중복이 아니면 스칼라 값 반환
___

In [111]:
df = DataFrame(np.random.randn(4,3),
              index = list('aabb'))
df

          0         1         2
a -0.534645 -0.159245  0.009430
a -0.151789 -0.908800 -0.000767
b -1.018591  1.524899  0.635550
b  0.597787  0.581809 -0.663793

In [112]:
df.loc['b']

          0         1         2
b -1.018591  1.524899  0.635550
b  0.597787  0.581809 -0.663793

데이터 프레임에서의 중복 인덱스 선택도 마찬가지임
___